Templates/external_disc_rotating-ami_transient/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;

// Dial: Controlled by C#
endTime         {{ end_time }};

deltaT          0.0002;
writeControl    adjustable;
writeInterval   0.02;
purgeWrite      0;
writeFormat     ascii;
writePrecision  7;
writeCompression no;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           1;
maxDeltaT       1;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;

        patches         (disc);
        rho             rhoInf;
        rhoInf          1.225; // Standard air density (kg/m3)

        // Reference values from our Contract
        magUInf         {{ mag_u_inf }};
        lRef            {{ disc_diameter }};
        Aref            {{ aref }};

        // Direction vectors (Standard wind tunnel orientation)
        dragDir         (1 0 0);
        liftDir         (0 1 0);
        pitchAxis       (0 0 1);
        CofR            (0 0 0); // Center of Rotation at CAD origin
    }
}

// ************************************************************************* //
